package BokSa1;

public class ClockGUI22 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		//-----------------------------------------------------------------------------------
		/*
		       (미리 알고 갑시다.)
		       
		       파이 = 원의 둘레 (원주) 와 지름의 길이의 비 (즉, 원주/지름 = 3.141592)
		       ==> 지름이 단위길이 1일때 원둘레 3.14가 나오더라
		       ==> 이 말은 원의 둘레길이는 항상 원의 반지름 * 2 * 3.14 하면 나오게 된다는 것.
		       1414213
		       
		       원의 넓이 : 
		       
		       1라디안 - 단위원에서 반지름과 호의 길이가 1:1 같은 경우, 약 57.4도
		       이때 180도는 파이라디안 (90도는 파이/2 360도는 2파이)
		       그러므로 1도 = 파이/180 라디안 ==> Math.PI/180 라디안
		       
		       
		       sin값 0 - 180도 > 0 , 180 - 360 < 0
		       cos값 270 - 90도 > 0 , 90 - 270도 < 0
		
		 */
		
	}

}
